
// Diners_ParserDlg : implementation file
//

#include "stdafx.h"
#include "Pulse_Parser.h"
#include "Pulse_ParserDlg.h"
#include "afxdialogex.h"
#include "PulseParser.h"
#include "BASICTYP.H"
#include <math.h>
#ifdef _DEBUG
#define new DEBUG_NEW
#endif




void	ascii_to_bin (LPBYTE src, LPBYTE dst, INT len);
INT		ncpul_Move_IfThere( enum bitfields fieldid, BYTE p_trantype );
struct	bitfield_data *ncpul_Find_Bitfield_Table( enum bitfields bitfield );
INT		ncpul_RspMovevData (enum bitfields fieldid);
INT		ncpul_vDataMove(enum bitfields fieldid);
INT		ncpul_GenericMove(enum bitfields fieldid);
INT		ncpul_Move_Always( enum bitfields bitfield, BYTE p_trantype );
INT		ncpul_Move_IfThere( enum bitfields fieldid, BYTE p_trantype );
INT		ncpul_RspMoveGeneric(enum bitfields fieldid); 
INT		ncpul_RspMovevData (enum bitfields fieldid);
void    parsed_mssg();
INT     parse_host_msg( pCHAR err_buf );
BYTE	ascii_ebcdic_conv(BYTE conv_char, char * conv_type );
BYTE	ascii_ebcdic_conv_trk1( unsigned char conv_char, char *conv_type,unsigned char fldSep);
void	genutil_EMV_To_Auth_Tx( BYTE * emv_raw, INT total_len, pAUTH_TX p_auth_tx );
void	genutil_bcd_to_asc (BYTE bstring[], INT blen, pCHAR astr, INT astr_len);
INT		ncpul_get_variable_length( unsigned char *DataField, int FieldLen );
INT		ncpul_parse_host_msg( pCHAR err_buf );
void genutil_hex_to_bin (pCHAR afield, INT how_many, BYTE bstring[]);



pAUTH_TX p_auth_tx;
AUTH_TX AUTH_TX_V;
EMV EMV_details;

// CAboutDlg dialog used for App About

class CAboutDlg : public CDialogEx
{
public:
	CAboutDlg();

// Dialog Data
	enum { IDD = IDD_ABOUTBOX };

	protected:
	virtual void DoDataExchange(CDataExchange* pDX);    // DDX/DDV support

// Implementation
protected:
	DECLARE_MESSAGE_MAP()
};

CAboutDlg::CAboutDlg() : CDialogEx(CAboutDlg::IDD)
{
}

void CAboutDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
}

BEGIN_MESSAGE_MAP(CAboutDlg, CDialogEx)
END_MESSAGE_MAP()


// Cex_amex_parserDlg dialog

Cex_amex_parserDlg::Cex_amex_parserDlg(CWnd* pParent /*=NULL*/)
	: CDialogEx(Cex_amex_parserDlg::IDD, pParent)
{
	m_hIcon = AfxGetApp()->LoadIcon(IDR_MAINFRAME);
	m_flowfile = _T("");
	m_parsedmssg = _T("");
}

void Cex_amex_parserDlg::DoDataExchange(CDataExchange* pDX)
{
	CDialogEx::DoDataExchange(pDX);
	DDX_Text(pDX, IDC_FLOWFILE, m_flowfile);
	DDX_Text(pDX, IDC_PARSEDMSG, m_parsedmssg);
	DDX_Control(pDX, IDC_PARSEDMSG, m_CntlParsedMsg);
	DDX_Control(pDX, IDC_EXPORT, exportbtn);
}

BEGIN_MESSAGE_MAP(Cex_amex_parserDlg, CDialogEx)
	ON_WM_SYSCOMMAND()
	ON_WM_PAINT()
	ON_WM_QUERYDRAGICON()
	ON_BN_CLICKED(IDC_PARSE, &Cex_amex_parserDlg::OnBnClickedParse)
	ON_EN_CHANGE(IDC_PARSEDMSG, &Cex_amex_parserDlg::OnEnChangeParsedmsg)
	ON_EN_CHANGE(IDC_FLOWFILE, &Cex_amex_parserDlg::OnEnChangeFlowfile)
	ON_BN_CLICKED(IDC_CLEAR, &Cex_amex_parserDlg::OnBnClickedClear)
	ON_BN_CLICKED(IDC_EXPORT, &Cex_amex_parserDlg::OnBnClickedExport)
END_MESSAGE_MAP()


// Cex_amex_parserDlg message handlers

BOOL Cex_amex_parserDlg::OnInitDialog()
{
	CDialogEx::OnInitDialog();

	// Add "About..." menu item to system menu.

	// IDM_ABOUTBOX must be in the system command range.
	ASSERT((IDM_ABOUTBOX & 0xFFF0) == IDM_ABOUTBOX);
	ASSERT(IDM_ABOUTBOX < 0xF000);

	CMenu* pSysMenu = GetSystemMenu(FALSE);
	if (pSysMenu != NULL)
	{
		BOOL bNameValid;
		CString strAboutMenu;
		bNameValid = strAboutMenu.LoadString(IDS_ABOUTBOX);
		ASSERT(bNameValid);
		if (!strAboutMenu.IsEmpty())
		{
			pSysMenu->AppendMenu(MF_SEPARATOR);
			pSysMenu->AppendMenu(MF_STRING, IDM_ABOUTBOX, strAboutMenu);
		}
	}

	// Set the icon for this dialog.  The framework does this automatically
	//  when the application's main window is not a dialog
	SetIcon(m_hIcon, TRUE);			// Set big icon
	SetIcon(m_hIcon, FALSE);		// Set small icon

	// TODO: Add extra initialization here
	m_CntlParsedMsg.SetWindowTextA("Hi");
	exportbtn.EnableWindow(FALSE);
	return TRUE;  // return TRUE  unless you set the focus to a control
}

void Cex_amex_parserDlg::OnSysCommand(UINT nID, LPARAM lParam)
{
	if ((nID & 0xFFF0) == IDM_ABOUTBOX)
	{
		CAboutDlg dlgAbout;
		dlgAbout.DoModal();
	}
	else
	{
		CDialogEx::OnSysCommand(nID, lParam);
	}
}

// If you add a minimize button to your dialog, you will need the code below
//  to draw the icon.  For MFC applications using the document/view model,
//  this is automatically done for you by the framework.

void Cex_amex_parserDlg::OnPaint()
{
	if (IsIconic())
	{
		CPaintDC dc(this); // device context for painting

		SendMessage(WM_ICONERASEBKGND, reinterpret_cast<WPARAM>(dc.GetSafeHdc()), 0);

		// Center icon in client rectangle
		int cxIcon = GetSystemMetrics(SM_CXICON);
		int cyIcon = GetSystemMetrics(SM_CYICON);
		CRect rect;
		GetClientRect(&rect);
		int x = (rect.Width() - cxIcon + 1) / 2;
		int y = (rect.Height() - cyIcon + 1) / 2;

		// Draw the icon
		dc.DrawIcon(x, y, m_hIcon);
	}
	else
	{
		CDialogEx::OnPaint();
	}
}

// The system calls this function to obtain the cursor to display while the user drags
//  the minimized window.
HCURSOR Cex_amex_parserDlg::OnQueryDragIcon()
{
	return static_cast<HCURSOR>(m_hIcon);
}

/***********************************************************************************************************/




void Generate_EMV_Details();
INT ncdci_Move_IfThere( enum bitfields fieldid, BYTE p_trantype );
struct bitfield_data *ncdci_Find_Bitfield_Table( enum bitfields bitfield );
 int ncdci_vDataMove(enum bitfields fieldid);
 int ncdci_get_variable_length( unsigned char *DataField, int FieldLen );
 int ncdci_RspMovevData (enum bitfields fieldid);
 INT ncdci_Move_Always( enum bitfields bitfield, BYTE p_trantype );
 INT ncdci_GenericMove(enum bitfields fieldid);
 INT ncdci_RspMoveGeneric(enum bitfields fieldid);
 INT ncdci_parse_host_msg( pCHAR err_buf );

 BYTE BitMap[64] = {0};
 char astr[64] = {0};

 /* Miscellaneous */
#define  PULSE_COMM_BUF_SZE          				1500
#define  PULSE_EXTENDED_BITFIELD_SIZE  				128
#define  PULSE_EXTENDED_BITMAP_SIZE					16
#define  PULSE_NORMAL_BITFIELD_SIZE    				64
#define  PULSE_NORMAL_BITMAP_SIZE					8
#define  PULSE_LOOKUP_KEY_SIZE         				22
#define  PULSE_TOTALL_MEG_LEN						4
#define  PULSE_ETX_TRN_TEXT							"0x03"
#define  PULSE_KEY_SIZE								48

 /*Message Type*/
#define PULSE_MESSAGE_TYPE_SIZE               			4
#define PULSE_NETWORK_REQ_MESSAGE						"0800"
#define PULSE_NETWORK_RESP_MESSAGE						"0810"
#define PULSE_SALE_REQ_MESSAGE							"0100"
#define PULSE_SALE_RESP_MESSAGE						"0110"
#define PULSE_ADVICE_REQ_MESSAGE						"0120"
#define PULSE_ADVICE_RESP_MESSAGE						"0130"
#define PULSE_REVERSAL_REQ_MESSAGE						"0420"
#define PULSE_REVERSAL_RESP_MESSAGE					"0430"
#define PULSE_ISO_SALE_REQ_MESSAGE_TYPE				 "0200"
#define PULSE_ISO_SALE_RESP_MESSAGE_TYPE				 "0210"
#define PULSE_ISO_AUTH_REQ_MESSAGE_TYPE				 "0100"
#define PULSE_ISO_AUTH_RESP_MESSAGE_TYPE				 "0110"
#define PULSE_ISO_REVESAL_REQ_MESSAGE_TYPE				 "0400"
#define PULSE_ISO_REVESAL_RESP_MESSAGE_TYPE			 "0410"
#define PULSE_ISO_SALE_COMPLETION_MESSAGE_TYPE			 "0220"
#define PULSE_FILE_UPDATE_REQ_MESSAGE_TYPE				"0304"
#define PULSE_FILE_UPDATE_RESP_MESSAGE_TYPE			 "0314"
#define PULSE_NEGATIVE_FILE_UPDATE_REQ_MESSAGE_TYPE	"0324"
#define PULSE_NEGATIVE_FILE_UPDATE_RESP_MESSAGE_TYPE	"0334"

static int temp_55_counter;
static char   Line[256][256];


/*CUP header*/
#define CUP_HDR_SIZE_SUCC 				46
#define MSG_HEADER_LEN 				 	1
#define MSG_HEADER_SUCC_DATA            0x2E
#define MSG_HEADER_FLAG_VER_LEN		 	0x01
#define MSG_HEADER_FLAG_TEST_VER		0x00
#define MSG_HEADER_FLAG_PROD_VER		0x01
#define MSG_HEADER_FLAG_CAD             0x02
#define MSG_HEADER_FLAG_KEY_SEND        0x81
#define TOL_MEG_LEN                  	4
#define DEST_ID_LEN						11
#define CUPS_ID                         "    00010344"
#define SOURCE_ID_LEN					11
#define RESV_FOR_USE_LEN				3
#define BATCH_NO_LEN					1
#define BATCH_NUM                       0x00
#define TRAN_INFO_LEN					8
#define TRAN_INFO_DATA                  "00000000"
#define USER_INFO_LEN					1
#define USER_INFO_DATA                  0x00
#define REJECT_CODE_LEN					5
#define REJECT_CODE_DATA                "00000"
#define CUP_HDR_SIZE_REJECTED           46

/* Other #define of CUP */
#define EXTENDED_BITFIELD              128
#define NORMAL_BITFIELD                64
#define COMM_BUF_SZE                   1500

/*EVM data Ascii Length */
#define APP_CRYT_DATA_ASCII_LEN			16
#define UNPRE_NUM_DATA_ASCII_LEN		8
#define ATC_DATA_ASCII_LEN				4
#define TVR_DATA_ASCII_LEN				10
#define TAR_DATE_DATA_ASCII_LEN			6
#define TAR_TYPE_DATA_ASCII_LEN			2
#define AMT_AUTH_DATA_ASCII_LEN			12
#define TRA_CUR_CODE_DATA_ASCII_LEN		4
#define TER_CUR_CODE_DATA_ASCII_LEN		4
#define AIP_DATA_ASCII_LEN				4
#define AMT_OTH_DATA_ASCII_LEN			12
#define APP_PAN_SEQ_NUM_DATA_ASCII_LEN	2
#define CRYPTO_INFO_DATA_ASCII_LEN		2
#define AMEX_EMV_MAX_LEN				255

#define N_BFData ( sizeof(BFData) / sizeof (struct bitfield_data) )

char FieldStrings [][256] =
{
"000 MsgType				: ",
"001 BitMap				    : ",
"002 PAN					: ",
"003 ProcessingCode			: ",
"004 TxnAmount				: ",
"005 SettleAmount		                     	: ",
"006 BillingAmount				: ",
"007 TransmitDateTime			: ",
"008 BillingFeeAmount		: ",
"009 convRateSettlement		    : ",
"010 convRateCardHolder				: ",
"011 SystemTraceNo			: ",
"012 TxnTime				: ",
"013 TxnDate				: ",
"014 ExpirationDate				: ",
"015 SettleDate				: ",
"016 ConvDate				: ",
"017 CaptureDate			: ",
"018 MerchantType				: ",
"019 AcquiringCountry			: ",
"020 PANExtCountry			: ",
"021 ForwardCountry			: ",
"022 POSEntryMode				: ",
"023 CardSequenceNo			: ",
"024 Functioncode				: ",
"025 POSConditionCode			: ",
"026 POSPINCode				: ",
"027 AuthIdLen				: ",
"028 TxnFeeAmount			: ",
"029 SettleFeeAmount		: ",
"030 OriginalAmount		: ",
//"031 SettleProcFeeAmount	: ",
"031 TransactionID			: ",
"032 AcquiringIdCode	                	: ",
"033 ForwardIdCode			: ",
"034 PANExt					: ",
"035 Track2				: ",
"036 Track3					: ",
"037 RetRefNo				: ", 
"038 AuthID				: ",
"039 ResponseCode				: ",
"040 ServiceRestrictCode	: ",
"041 TerminalID				: ",
"042 AcquirerID				: ",
"043 AcquirerName				: ",
"044 AddRespData				: ",
"045 Track1					: ",
"046 Additional_Fees				: ",
"047 AdditionalData			: ",
"048 Merch_name			: ",
"049 TxnCurrency				: ",
"050 SettleCurrency				: ",
"051 Card_curr_cd				: ",
"052 PINData				: ",
"053 SecurityInfo				: ",
"054 AddAmounts				: ",
"055 IccData				: ",
"056 Rplcment_additional_fee				: ",
"057 Auth_life_cycle				: ",
"058 National_pos_cc				: ",
"059 Nationalposgeogrphic_data				: ",
"060 Advice_reason_code 				: ",
"061 Acq_transport_data			: ",
"062 Iss_transport_data				: ",
"063 Pulse_data				: ",
"064 MsgAuthCode			: ",
"065 Field 65               : ",
"066 SettlementCode			: ",
"067 PaymentCodeEx			: ",
"068 RecInstCntrCode		: ",
"069 SettlInstCntrCode		: ",
"070 NetworkInfCode			: ",
"071 MessageNo				: ",
"072 Datarecord			: ",
"073 DateAction				: ",
"074 CreditsNo				: ",
"075 CreditsRevNo			: ",
"076 DebitsNo				: ",
"077 DebitsRevNo			: ",
"078 TransferNo				: ",
"079 TransferRevNo			: ",
"080 InquiriesNo			: ",
"081 AuthNo					: ",
"082 CProcFeeAmount			: ",
"083 CTxnFeeAmount			: ",
"084 DProcFeeAmount			: ",
"085 DTxnFeeAmount			: ",
"086 CAmount				: ",
"087 CRevAmount				: ",
"088 DAmount				: ",
"089 DRevAmount				: ",
"090 OriginDataElement		: ",
"091 FileUpdateCode			: ",
"092 TxorigIntcntrycode			: ",
"093 TxnDestination_ICC			: ",
"094 TxnOriginator_ICC			: ",
"095 ReplacementAmounts		: ",
"096 Msg_security_code			: ",
"097 AmountNetSettle		: ",
"098 Payee					: ",
"099 SettleIdCode			: ",
"100 ReceivingIdCode			: ",
"101 Filename				: ",
"102 AccountId1				: ",
"103 AccountId2				: ",
"104 TxnDescription			: ",
"105 Large_pvt_data1				: ",
"106 Field106				: ",
"107 Field107				: ",
"108 Field108				: ",
"109 Sender_data				: ",
"110 Receiver_data				: ",
"111 Additional_data_acq				: ",
"112 Field112				: ",
"113 Auth_agent_inst_id_code				: ",
"114 Country_code				: ",
"115 Field115				: ",
"116 Field116				: ",
"117 Field117				: ",
"118 Field118				: ",
"119 Field119				: ",
"120 Account_qualifiers				: ",
"121 Additional_data_iss				: ",
"122 Sponsor_bank_id				: ",
"123 Avs_check_auth_data			: ",
"124 Info				: ",
"125 Network_Mngment_info				: ",
"126 Iss_trace_data				: ",
"127 Acq_trace_data				: ",
"128 MsgAuthCode				: ",
"129 Field129				: ",
"130 Field130				: ",
"131 Field131				: ",
"132 Field132				: ",
"133 Field133				: ",
"134 Field134				: ",
"135 Field135				: ",
"136 Field136				: ",
"137 Field137				: ",
"138 Field138				: ",
"139 Field139				: ",
"140 Field140				: ",
"141 Field141				: ",
"142 Field142				: ",
"143 Field143				: ",
"144 Field144				: ",
"145 Field145				: ",
"146 Field146				: ",
"147 Field147				: ",
"148 Field148				: ",
"149 Field149				: ",
"150 Field150				: ",
"151 Field151				: ",
"152 Field152				: ",
"153 Field153				: ",
"154 Field154				: ",
"155 Field155				: ",
"156 Field156				: ",
"157 Field157				: ",
"158 Field158				: ",
"159 Field159				: ",
"160 Field160				: ",
"161 Field161				: ",
"162 Field162				: ",
"163 Field163				: ",
"164 Field164				: ",
"165 Field165				: ",
"166 Field166				: ",
"167 Field167				: ",
"168 Field168				: ",
"169 Field169				: ",
"170 Field170				: ",
"171 Field171				: ",
"172 Field172				: ",
"173 Field173				: ",
"174 Field174				: ",
"175 Field175				: ",
"176 Field176				: ",
"177 Field177				: ",
"178 Field178				: ",
"179 Field179				: ",
"180 Field180				: ",
"181 Field181				: ",
"182 Field182				: ",
"183 Field183				: ",
"184 Field184				: ",
"185 Field185				: ",
"186 Field186				: ",
"187 Field187				: ",
"188 Field188				: ",
"189 Field189				: ",
"190 Field190				: ",
"191 Field191				: ",
"192 Field192				: "
};




struct iso_msg_rec
{
   BYTE msgtype       				[4];
   BYTE bitmap1_bin   				[16];
   BYTE bitmap2_bin  				[16];
   BYTE pan_len       				[2];
   BYTE pan           				[19];
   BYTE proccode      				[6];
   BYTE amount        				[12];
   BYTE Settlement_amount			[12];//5
   BYTE ch_bill_amt   				[12];
   BYTE gmt_time      				[10];
   BYTE convRateSettlement			[8];//9
   BYTE convRateCardHolder			[8];//10
   BYTE stan          				[6];
   BYTE time          				[6];// hhmmss
   BYTE date		  				[4];
   BYTE date_expd	  				[4];
   BYTE SettleDate					[4];//15
   BYTE conversionDate				[4];//16
   BYTE captureDate					[4];//17
   BYTE Merch_type					[4];//18
   BYTE Acq_country_code			[3];//19
   BYTE posentry      				[3];//22
   BYTE card_seq_num  				[3];//23
   BYTE Pos_pin_capture_code   		[2];//26
   BYTE Txn_Fee_Amount				[9];//28
   BYTE Settlement_Fee_Amount		[9];//29
   BYTE acq_inst_len  				[2];//32
   BYTE acq_inst_id   				[11];
   BYTE fwd_inst_len  				[2];//33
   BYTE fwd_inst_id   				[11];
   BYTE track2_len    				[2];//35
   BYTE track2        				[37];
   BYTE rrn			  				[12];//37
   BYTE authcode      				[6];//38
   BYTE responsecd    				[2];//39
   BYTE service_code   				[3];//40
   BYTE termid        				[8];//41
   BYTE cardaccid     				[15];//42
   BYTE cardaccname 				[40];//43
   BYTE addl_rsp_len  				[2];
   BYTE addlrspdata   				[25];//44
   BYTE Additional_Fees_len			[3];//46
   BYTE Additional_Fees 			[88];
   BYTE addl_data_len				[3];//47
   BYTE addl_data     				[100];
   BYTE Merch_name_len				[3];//48
   BYTE Merch_name					[25];
   BYTE tran_curr_cd  				[3];//49
   BYTE settlement_curr_cd			[3];//50
   BYTE card_curr_cd				[3];//51
   BYTE pinblock      				[16];//52
   BYTE AddlAmts_len   				[3];//54
   BYTE AddlAmts     				[120];
   BYTE IccData_len   				[3];//55
   BYTE IccData	    				[255];
   BYTE Rplcment_additional_fee_len [3];//56
   BYTE Rplcment_additional_fee		[88];
   BYTE Auth_life_cycle_len			[3];//57
   BYTE Auth_life_cycle				[3];
   BYTE National_pos_cc_len			[3];//58
   BYTE National_pos_cc				[11];
   BYTE Nationalposgeogrphic_datalen[3];//59
   BYTE Nationalposgeographic_data	[17];
   BYTE Advice_reason_code_len		[3];//60
   BYTE	Advice_reason_code			[6];
   BYTE Acq_transport_data_len		[3];//61
   BYTE Acq_transport_data			[100];
   BYTE Iss_transport_data_len		[3];//62
   BYTE Iss_transport_data			[100];
   BYTE Pulse_data_len				[3];//63
   BYTE Pulse_data					[50];
   BYTE Network_Management_info_code[3];//70
   BYTE Original_data				[42];//90
   BYTE File_update_code			[1];//91
   BYTE Replace_amounts				[42];//95
   BYTE Msg_security_code			[8];//96
   BYTE Payee						[25];//98
   BYTE file_name_len				[2];//101
   BYTE file_name					[17];
   BYTE Account_identificaton1_len	[2];//102
   BYTE Account_identificaton1		[28];
   BYTE Account_identificaton2_len	[2];//103
   BYTE Account_identificaton2		[28];
   BYTE Txn_description_len			[3];//104
   BYTE Txn_description				[100];
   BYTE Large_pvt_data1_len			[3];//105
   BYTE Large_pvt_data1				[999];
   BYTE Sender_data_len				[3];//109
   BYTE Sender_data					[255];
   BYTE Receiver_data_len			[3];//110
   BYTE Receiver_data				[255];
   BYTE Additional_data_acq_len		[3];//111
   BYTE Additional_data_acq			[255];
   BYTE Auth_agent_inst_id_code_len [3];//113
   BYTE Auth_agent_inst_id_code	 	[11];
   BYTE Country_code_len			[3];//114
   BYTE Country_code				[3];
   BYTE Account_qualifiers_len		[3];//120
   BYTE Account_qualifiers			[6];
   BYTE Additional_data_iss_len		[3];//121
   BYTE Additional_data_iss			[255];
   BYTE Sponsor_bank_id_len			[3];//122
   BYTE Sponsor_bank_id				[11];
   BYTE Avs_check_auth_data_len		[3];//123
   BYTE Avs_check_auth_data			[255];
   BYTE Info_len					[3];//124
   BYTE Info						[255];
   BYTE Network_Mngment_info_len	[3];//125
   BYTE Network_Mngment_info		[125];
   BYTE Iss_trace_data_len			[3];//126
   BYTE	Iss_trace_data				[100];
   BYTE Acq_trace_data_len			[3];//127
   BYTE	Acq_trace_data				[100];
};
struct FieldNumberMappingToIsoMsgRec
{
	void *fldPtr[1000];
};


/*****************************************************************************
 *********************** Define all globals required here ********************
 *****************************************************************************/

INT     Field63_present;
INT		Field62_present;
INT     BitFieldSize    = NORMAL_BITFIELD;
INT		bitmapidx;              /* offset of bitmap... */
INT		reqidx;                  /* next open position in request buffer */
INT		buflen;  
INT		Txn_Is_A_Reject;
INT		invalid_msg_format;
struct	iso_msg_rec ncpul_HOST_MESSAGE;
BYTE  iccdata[256]={0};

BYTE   ReqRsp_Buffer [COMM_BUF_SZE];

char  A2E[4] = "A2E";    /*  ASCII to EBCDIC conversion */
char  E2A[4] = "E2A";    /*  EBCDIC to ASCII conversion */





struct isobit 
   {
   INT byte_no;         /* byte number for this bit field */
